# Задано число. Проверить, что оно больше 100, то вывести "долгожитель", иначе "Занимайся физкультурой"
# Функциональная декомпозиция
#
# 1. Объявить переменную
# 2. Проверить условие
# 3. Вывести результат проверки условия
#
# Переменная Оператор Данные
# Условный оператор (выражение)
#     Блок кода
#     функция(аргументы)
#     исключение

# autor: Nikonov I. T.
# date: 30.09.24
# todo: Доучиться



my_age = 29

if my_age > 100:
    print("Долгожитель")
else:
    print("Занимайся физкультурой")
