# todo: Определить в коде переменные:
# 1. Целочисленного типа
# 2. Вещественного типа
# 3. Логического типа
# 4. Строкового типа
# 5. Пустого типа
# Вывести их типы.

type_int = 10
type_float = 10.1
type_bool = True
type_string = "Hello World"
type_none = None

print(type(type_int))
print(type(type_float))
print(type(type_bool))
print(type(type_string))
print(type(type_none))